Terraform plan in __.__
<details>
  <summary>Plan: 5 to add, 0 to change, 5 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.catalog.module.db.module.database.aws_db_instance.default must be replaced
-/+ resource "aws_db_instance" "default" {
      ~ address                               = "terraform-20200416212345327700000001.clsowbdquocd.us-east-1.rds.amazonaws.com" -> (known after apply)
        allocated_storage                     = 30
      + apply_immediately                     = (known after apply)
      ~ arn                                   = "arn:aws:rds:us-east-1:587807691409:db:terraform-20200416212345327700000001" -> (known after apply)
        auto_minor_version_upgrade            = true
      ~ availability_zone                     = "us-east-1a" -> (known after apply)
      ~ backup_retention_period               = 0 -> (known after apply)
      ~ backup_window                         = "07:44-08:14" -> (known after apply)
      ~ ca_cert_identifier                    = "***********" -> (known after apply)
      + character_set_name                    = (known after apply)
        copy_tags_to_snapshot                 = false
        db_subnet_group_name                  = "datagov-sandbox"
        delete_automated_backups              = true
      - deletion_protection                   = false -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "terraform-20200416212345327700000001.clsowbdquocd.us-east-1.rds.amazonaws.com:5432" -> (known after apply)
        engine                                = "postgres"
      ~ engine_version                        = "9.6.20" -> "9.6.1"
      ~ hosted_zone_id                        = "**************" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "************************************" -> (known after apply)
      ~ identifier                            = "************************************" -> (known after apply)
      + identifier_prefix                     = (known after apply)
        instance_class                        = "db.t2.micro"
      - iops                                  = 0 -> null
      + kms_key_id                            = (known after apply)
      ~ license_model                         = "postgresql-license" -> (known after apply)
      ~ maintenance_window                    = "mon:05:49-mon:06:19" -> (known after apply)
      - max_allocated_storage                 = 0 -> null
        monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
        multi_az                              = false
        name                                  = "catalog_db"
      ~ option_group_name                     = "default:postgres-9-6" -> (known after apply)
        parameter_group_name                  = "default.postgres9.6"
        password                              = (sensitive value)
        performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
        publicly_accessible                   = false
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "*****************************" -> (known after apply)
      - security_group_names                  = [] -> null
        skip_final_snapshot                   = true
      ~ status                                = "available" -> (known after apply)
      ~ storage_encrypted                     = false -> true # forces replacement
        storage_type                          = "gp2"
      - tags                                  = {} -> null
      + timezone                              = (known after apply)
        username                              = "catalog_master"
        vpc_security_group_ids                = [
            "sg-0c0c5c5f506b713aa",
        ]
    }

  # module.catalog_next.module.db.module.database.aws_db_instance.default must be replaced
-/+ resource "aws_db_instance" "default" {
      ~ address                               = "terraform-20210107225633247100000001.clsowbdquocd.us-east-1.rds.amazonaws.com" -> (known after apply)
        allocated_storage                     = 30
      + apply_immediately                     = (known after apply)
      ~ arn                                   = "arn:aws:rds:us-east-1:587807691409:db:terraform-20210107225633247100000001" -> (known after apply)
        auto_minor_version_upgrade            = true
      ~ availability_zone                     = "us-east-1a" -> (known after apply)
      ~ backup_retention_period               = 0 -> (known after apply)
      ~ backup_window                         = "04:34-05:04" -> (known after apply)
      ~ ca_cert_identifier                    = "***********" -> (known after apply)
      + character_set_name                    = (known after apply)
        copy_tags_to_snapshot                 = false
        db_subnet_group_name                  = "datagov-sandbox"
        delete_automated_backups              = true
      - deletion_protection                   = false -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "terraform-20210107225633247100000001.clsowbdquocd.us-east-1.rds.amazonaws.com:5432" -> (known after apply)
        engine                                = "postgres"
      ~ engine_version                        = "9.6.20" -> "9.6.1"
      ~ hosted_zone_id                        = "**************" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "************************************" -> (known after apply)
      ~ identifier                            = "************************************" -> (known after apply)
      + identifier_prefix                     = (known after apply)
        instance_class                        = "db.t2.micro"
      - iops                                  = 0 -> null
      + kms_key_id                            = (known after apply)
      ~ license_model                         = "postgresql-license" -> (known after apply)
      ~ maintenance_window                    = "mon:05:29-mon:05:59" -> (known after apply)
      - max_allocated_storage                 = 0 -> null
        monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
        multi_az                              = false
        name                                  = "catalog_db_next"
      ~ option_group_name                     = "default:postgres-9-6" -> (known after apply)
        parameter_group_name                  = "default.postgres9.6"
        password                              = (sensitive value)
        performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
        publicly_accessible                   = false
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "*****************************" -> (known after apply)
      - security_group_names                  = [] -> null
        skip_final_snapshot                   = true
      ~ status                                = "available" -> (known after apply)
      ~ storage_encrypted                     = false -> true # forces replacement
        storage_type                          = "gp2"
      - tags                                  = {} -> null
      + timezone                              = (known after apply)
        username                              = "catalog_master"
        vpc_security_group_ids                = [
            "sg-045bcc020ec290669",
        ]
    }

  # module.dashboard.module.db.module.database.aws_db_instance.default must be replaced
-/+ resource "aws_db_instance" "default" {
      ~ address                               = "terraform-20200416212304398200000001.clsowbdquocd.us-east-1.rds.amazonaws.com" -> (known after apply)
        allocated_storage                     = 20
      + apply_immediately                     = (known after apply)
      ~ arn                                   = "arn:aws:rds:us-east-1:587807691409:db:terraform-20200416212304398200000001" -> (known after apply)
        auto_minor_version_upgrade            = true
      ~ availability_zone                     = "us-east-1a" -> (known after apply)
      ~ backup_retention_period               = 0 -> (known after apply)
      ~ backup_window                         = "09:42-10:12" -> (known after apply)
      ~ ca_cert_identifier                    = "***********" -> (known after apply)
      + character_set_name                    = (known after apply)
        copy_tags_to_snapshot                 = false
        db_subnet_group_name                  = "datagov-sandbox"
        delete_automated_backups              = true
      - deletion_protection                   = false -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "terraform-20200416212304398200000001.clsowbdquocd.us-east-1.rds.amazonaws.com:3306" -> (known after apply)
        engine                                = "mysql"
      ~ engine_version                        = "5.7.22" -> "5.7"
      ~ hosted_zone_id                        = "**************" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "************************************" -> (known after apply)
      ~ identifier                            = "************************************" -> (known after apply)
      + identifier_prefix                     = (known after apply)
        instance_class                        = "db.t2.micro"
      - iops                                  = 0 -> null
      + kms_key_id                            = (known after apply)
      ~ license_model                         = "general-public-license" -> (known after apply)
      ~ maintenance_window                    = "tue:08:25-tue:08:55" -> (known after apply)
      - max_allocated_storage                 = 0 -> null
        monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
        multi_az                              = false
        name                                  = "dashboard_db"
      ~ option_group_name                     = "default:mysql-5-7" -> (known after apply)
        parameter_group_name                  = "default.mysql5.7"
        password                              = (sensitive value)
        performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 3306 -> (known after apply)
        publicly_accessible                   = false
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "*****************************" -> (known after apply)
      - security_group_names                  = [] -> null
        skip_final_snapshot                   = true
      ~ status                                = "available" -> (known after apply)
      ~ storage_encrypted                     = false -> true # forces replacement
        storage_type                          = "gp2"
      - tags                                  = {} -> null
      + timezone                              = (known after apply)
        username                              = "dashboard_master"
        vpc_security_group_ids                = [
            "sg-0d1c2702a5ed97a2b",
        ]
    }

  # module.inventory_next.module.db.module.database.aws_db_instance.default must be replaced
-/+ resource "aws_db_instance" "default" {
      ~ address                               = "terraform-20200908223640313700000001.clsowbdquocd.us-east-1.rds.amazonaws.com" -> (known after apply)
        allocated_storage                     = 20
      + apply_immediately                     = (known after apply)
      ~ arn                                   = "arn:aws:rds:us-east-1:587807691409:db:terraform-20200908223640313700000001" -> (known after apply)
        auto_minor_version_upgrade            = true
      ~ availability_zone                     = "us-east-1b" -> (known after apply)
      ~ backup_retention_period               = 0 -> (known after apply)
      ~ backup_window                         = "06:57-07:27" -> (known after apply)
      ~ ca_cert_identifier                    = "***********" -> (known after apply)
      + character_set_name                    = (known after apply)
        copy_tags_to_snapshot                 = false
        db_subnet_group_name                  = "datagov-sandbox"
        delete_automated_backups              = true
      - deletion_protection                   = false -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "terraform-20200908223640313700000001.clsowbdquocd.us-east-1.rds.amazonaws.com:5432" -> (known after apply)
        engine                                = "postgres"
      ~ engine_version                        = "9.6.20" -> "9.6.1"
      ~ hosted_zone_id                        = "**************" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "************************************" -> (known after apply)
      ~ identifier                            = "************************************" -> (known after apply)
      + identifier_prefix                     = (known after apply)
        instance_class                        = "db.t2.micro"
      - iops                                  = 0 -> null
      + kms_key_id                            = (known after apply)
      ~ license_model                         = "postgresql-license" -> (known after apply)
      ~ maintenance_window                    = "sun:04:31-sun:05:01" -> (known after apply)
      - max_allocated_storage                 = 0 -> null
        monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
        multi_az                              = false
        name                                  = "inventory_db_next"
      ~ option_group_name                     = "default:postgres-9-6" -> (known after apply)
        parameter_group_name                  = "default.postgres9.6"
        password                              = (sensitive value)
        performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
        publicly_accessible                   = false
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "*****************************" -> (known after apply)
      - security_group_names                  = [] -> null
        skip_final_snapshot                   = true
      ~ status                                = "available" -> (known after apply)
      ~ storage_encrypted                     = false -> true # forces replacement
        storage_type                          = "gp2"
      - tags                                  = {} -> null
      + timezone                              = (known after apply)
        username                              = "inventory_master"
        vpc_security_group_ids                = [
            "sg-01b250d2b1c81778b",
        ]
    }

  # module.wordpress.module.db.module.database.aws_db_instance.default must be replaced
-/+ resource "aws_db_instance" "default" {
      ~ address                               = "terraform-20200416212302214500000001.clsowbdquocd.us-east-1.rds.amazonaws.com" -> (known after apply)
        allocated_storage                     = 20
      + apply_immediately                     = (known after apply)
      ~ arn                                   = "arn:aws:rds:us-east-1:587807691409:db:terraform-20200416212302214500000001" -> (known after apply)
        auto_minor_version_upgrade            = true
      ~ availability_zone                     = "us-east-1b" -> (known after apply)
      ~ backup_retention_period               = 0 -> (known after apply)
      ~ backup_window                         = "08:37-09:07" -> (known after apply)
      ~ ca_cert_identifier                    = "***********" -> (known after apply)
      + character_set_name                    = (known after apply)
        copy_tags_to_snapshot                 = false
        db_subnet_group_name                  = "datagov-sandbox"
        delete_automated_backups              = true
      - deletion_protection                   = false -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "terraform-20200416212302214500000001.clsowbdquocd.us-east-1.rds.amazonaws.com:3306" -> (known after apply)
        engine                                = "mysql"
      ~ engine_version                        = "5.7.22" -> "5.7"
      ~ hosted_zone_id                        = "**************" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "************************************" -> (known after apply)
      ~ identifier                            = "************************************" -> (known after apply)
      + identifier_prefix                     = (known after apply)
        instance_class                        = "db.t2.micro"
      - iops                                  = 0 -> null
      + kms_key_id                            = (known after apply)
      ~ license_model                         = "general-public-license" -> (known after apply)
      ~ maintenance_window                    = "wed:05:51-wed:06:21" -> (known after apply)
      - max_allocated_storage                 = 0 -> null
        monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
        multi_az                              = false
        name                                  = "wordpress_db"
      ~ option_group_name                     = "default:mysql-5-7" -> (known after apply)
        parameter_group_name                  = "default.mysql5.7"
        password                              = (sensitive value)
        performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 3306 -> (known after apply)
        publicly_accessible                   = false
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "*****************************" -> (known after apply)
      - security_group_names                  = [] -> null
        skip_final_snapshot                   = true
      ~ status                                = "available" -> (known after apply)
      ~ storage_encrypted                     = false -> true # forces replacement
        storage_type                          = "gp2"
      - tags                                  = {} -> null
      + timezone                              = (known after apply)
        username                              = "wordpress_master"
        vpc_security_group_ids                = [
            "sg-0f20bfde5c89db743",
        ]
    }

Plan: 5 to add, 0 to change, 5 to destroy.

Warning: Provider source not supported in Terraform v0.12

  on /github/home/.dflook-terraform-data-dir/modules/vpc.vpc/versions.tf line 5, in terraform:
   5:     aws = {
   6:       source  = "hashicorp/aws"
   7:       version = ">= 2.70"
   8:     }

A source was declared for provider aws. Terraform v0.12 does not support the
provider source attribute. It will be ignored.
```
</details>

Plan generated in [plan #8](https://github.com/GSA/datagov-infrastructure-live/actions/runs/658837236)